#### Terraform Plane 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mkubernetes_namespace.app: Refreshing state... [id=hyphen][0m
[0m[1mkubernetes_deployment.app: Refreshing state... [id=hyphen/hyphen-app][0m
[0m[1mkubernetes_service.app: Refreshing state... [id=hyphen/app-service][0m
[0m[1mkubernetes_ingress.app: Refreshing state... [id=hyphen/web-ingress][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # kubernetes_deployment.app[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "kubernetes_deployment" "app" {
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mwait_for_rollout[0m[0m = true

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m           = {
              [32m+[0m [0m"app" = "hyphen-app"
            }
          [32m+[0m [0m[1m[0mname[0m[0m             = "hyphen-app"
          [32m+[0m [0m[1m[0mnamespace[0m[0m        = "hyphen"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mself_link[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }

      [32m+[0m [0mspec {
          [32m+[0m [0m[1m[0mmin_ready_seconds[0m[0m         = 0
          [32m+[0m [0m[1m[0mpaused[0m[0m                    = false
          [32m+[0m [0m[1m[0mprogress_deadline_seconds[0m[0m = 600
          [32m+[0m [0m[1m[0mreplicas[0m[0m                  = "3"
          [32m+[0m [0m[1m[0mrevision_history_limit[0m[0m    = 10

          [32m+[0m [0mselector {
              [32m+[0m [0m[1m[0mmatch_labels[0m[0m = {
                  [32m+[0m [0m"app" = "hyphen-app"
                }
            }

          [32m+[0m [0mstrategy {
              [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

              [32m+[0m [0mrolling_update {
                  [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
                  [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mtemplate {
              [32m+[0m [0mmetadata {
                  [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
                  [32m+[0m [0m[1m[0mlabels[0m[0m           = {
                      [32m+[0m [0m"app" = "hyphen-app"
                    }
                  [32m+[0m [0m[1m[0mname[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mself_link[0m[0m        = (known after apply)
                  [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
                }

              [32m+[0m [0mspec {
                  [32m+[0m [0m[1m[0mautomount_service_account_token[0m[0m  = true
                  [32m+[0m [0m[1m[0mdns_policy[0m[0m                       = "ClusterFirst"
                  [32m+[0m [0m[1m[0menable_service_links[0m[0m             = true
                  [32m+[0m [0m[1m[0mhost_ipc[0m[0m                         = false
                  [32m+[0m [0m[1m[0mhost_network[0m[0m                     = false
                  [32m+[0m [0m[1m[0mhost_pid[0m[0m                         = false
                  [32m+[0m [0m[1m[0mhostname[0m[0m                         = (known after apply)
                  [32m+[0m [0m[1m[0mnode_name[0m[0m                        = (known after apply)
                  [32m+[0m [0m[1m[0mrestart_policy[0m[0m                   = "Always"
                  [32m+[0m [0m[1m[0mservice_account_name[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mshare_process_namespace[0m[0m          = false
                  [32m+[0m [0m[1m[0mtermination_grace_period_seconds[0m[0m = 30

                  [32m+[0m [0mcontainer {
                      [32m+[0m [0m[1m[0mimage[0m[0m                      = "jeewansoori/hyphen-app"
                      [32m+[0m [0m[1m[0mimage_pull_policy[0m[0m          = (known after apply)
                      [32m+[0m [0m[1m[0mname[0m[0m                       = "hyphen-app"
                      [32m+[0m [0m[1m[0mstdin[0m[0m                      = false
                      [32m+[0m [0m[1m[0mstdin_once[0m[0m                 = false
                      [32m+[0m [0m[1m[0mtermination_message_path[0m[0m   = "/dev/termination-log"
                      [32m+[0m [0m[1m[0mtermination_message_policy[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mtty[0m[0m                        = false

                      [32m+[0m [0mport {
                          [32m+[0m [0m[1m[0mcontainer_port[0m[0m = 5000
                          [32m+[0m [0m[1m[0mprotocol[0m[0m       = "TCP"
                        }

                      [32m+[0m [0mresources {
                          [32m+[0m [0m[1m[0mlimits[0m[0m   = {
                              [32m+[0m [0m"cpu"    = "0.5"
                              [32m+[0m [0m"memory" = "128Mi"
                            }
                          [32m+[0m [0m[1m[0mrequests[0m[0m = {
                              [32m+[0m [0m"cpu"    = "250m"
                              [32m+[0m [0m"memory" = "50Mi"
                            }
                        }

                      [32m+[0m [0mvolume_mount {
                          [32m+[0m [0m[1m[0mmount_path[0m[0m        = (known after apply)
                          [32m+[0m [0m[1m[0mmount_propagation[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mname[0m[0m              = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m         = (known after apply)
                          [32m+[0m [0m[1m[0msub_path[0m[0m          = (known after apply)
                        }
                    }

                  [32m+[0m [0mimage_pull_secrets {
                      [32m+[0m [0m[1m[0mname[0m[0m = (known after apply)
                    }

                  [32m+[0m [0mreadiness_gate {
                      [32m+[0m [0m[1m[0mcondition_type[0m[0m = (known after apply)
                    }

                  [32m+[0m [0mvolume {
                      [32m+[0m [0m[1m[0mname[0m[0m = (known after apply)

                      [32m+[0m [0maws_elastic_block_store {
                          [32m+[0m [0m[1m[0mfs_type[0m[0m   = (known after apply)
                          [32m+[0m [0m[1m[0mpartition[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mvolume_id[0m[0m = (known after apply)
                        }

                      [32m+[0m [0mazure_disk {
                          [32m+[0m [0m[1m[0mcaching_mode[0m[0m  = (known after apply)
                          [32m+[0m [0m[1m[0mdata_disk_uri[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mdisk_name[0m[0m     = (known after apply)
                          [32m+[0m [0m[1m[0mfs_type[0m[0m       = (known after apply)
                          [32m+[0m [0m[1m[0mkind[0m[0m          = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m     = (known after apply)
                        }

                      [32m+[0m [0mazure_file {
                          [32m+[0m [0m[1m[0mread_only[0m[0m        = (known after apply)
                          [32m+[0m [0m[1m[0msecret_name[0m[0m      = (known after apply)
                          [32m+[0m [0m[1m[0msecret_namespace[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mshare_name[0m[0m       = (known after apply)
                        }

                      [32m+[0m [0mceph_fs {
                          [32m+[0m [0m[1m[0mmonitors[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mpath[0m[0m        = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m   = (known after apply)
                          [32m+[0m [0m[1m[0msecret_file[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0muser[0m[0m        = (known after apply)

                          [32m+[0m [0msecret_ref {
                              [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
                              [32m+[0m [0m[1m[0mnamespace[0m[0m = (known after apply)
                            }
                        }

                      [32m+[0m [0mcinder {
                          [32m+[0m [0m[1m[0mfs_type[0m[0m   = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mvolume_id[0m[0m = (known after apply)
                        }

                      [32m+[0m [0mconfig_map {
                          [32m+[0m [0m[1m[0mdefault_mode[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
                          [32m+[0m [0m[1m[0moptional[0m[0m     = (known after apply)

                          [32m+[0m [0mitems {
                              [32m+[0m [0m[1m[0mkey[0m[0m  = (known after apply)
                              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                              [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)
                            }
                        }

                      [32m+[0m [0mcsi {
                          [32m+[0m [0m[1m[0mdriver[0m[0m            = (known after apply)
                          [32m+[0m [0m[1m[0mfs_type[0m[0m           = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m         = (known after apply)
                          [32m+[0m [0m[1m[0mvolume_attributes[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mvolume_handle[0m[0m     = (known after apply)

                          [32m+[0m [0mcontroller_expand_secret_ref {
                              [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
                              [32m+[0m [0m[1m[0mnamespace[0m[0m = (known after apply)
                            }

                          [32m+[0m [0mcontroller_publish_secret_ref {
                              [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
                              [32m+[0m [0m[1m[0mnamespace[0m[0m = (known after apply)
                            }

                          [32m+[0m [0mnode_publish_secret_ref {
                              [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
                              [32m+[0m [0m[1m[0mnamespace[0m[0m = (known after apply)
                            }

                          [32m+[0m [0mnode_stage_secret_ref {
                              [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
                              [32m+[0m [0m[1m[0mnamespace[0m[0m = (known after apply)
                            }
                        }

                      [32m+[0m [0mdownward_api {
                          [32m+[0m [0m[1m[0mdefault_mode[0m[0m = (known after apply)

                          [32m+[0m [0mitems {
                              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                              [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)

                              [32m+[0m [0mfield_ref {
                                  [32m+[0m [0m[1m[0mapi_version[0m[0m = (known after apply)
                                  [32m+[0m [0m[1m[0mfield_path[0m[0m  = (known after apply)
                                }

                              [32m+[0m [0mresource_field_ref {
                                  [32m+[0m [0m[1m[0mcontainer_name[0m[0m = (known after apply)
                                  [32m+[0m [0m[1m[0mdivisor[0m[0m        = (known after apply)
                                  [32m+[0m [0m[1m[0mresource[0m[0m       = (known after apply)
                                }
                            }
                        }

                      [32m+[0m [0mempty_dir {
                          [32m+[0m [0m[1m[0mmedium[0m[0m     = (known after apply)
                          [32m+[0m [0m[1m[0msize_limit[0m[0m = (known after apply)
                        }

                      [32m+[0m [0mfc {
                          [32m+[0m [0m[1m[0mfs_type[0m[0m      = (known after apply)
                          [32m+[0m [0m[1m[0mlun[0m[0m          = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mtarget_ww_ns[0m[0m = (known after apply)
                        }

                      [32m+[0m [0mflex_volume {
                          [32m+[0m [0m[1m[0mdriver[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mfs_type[0m[0m   = (known after apply)
                          [32m+[0m [0m[1m[0moptions[0m[0m   = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m = (known after apply)

                          [32m+[0m [0msecret_ref {
                              [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
                              [32m+[0m [0m[1m[0mnamespace[0m[0m = (known after apply)
                            }
                        }

                      [32m+[0m [0mflocker {
                          [32m+[0m [0m[1m[0mdataset_name[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mdataset_uuid[0m[0m = (known after apply)
                        }

                      [32m+[0m [0mgce_persistent_disk {
                          [32m+[0m [0m[1m[0mfs_type[0m[0m   = (known after apply)
                          [32m+[0m [0m[1m[0mpartition[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mpd_name[0m[0m   = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m = (known after apply)
                        }

                      [32m+[0m [0mgit_repo {
                          [32m+[0m [0m[1m[0mdirectory[0m[0m  = (known after apply)
                          [32m+[0m [0m[1m[0mrepository[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mrevision[0m[0m   = (known after apply)
                        }

                      [32m+[0m [0mglusterfs {
                          [32m+[0m [0m[1m[0mendpoints_name[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mpath[0m[0m           = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m      = (known after apply)
                        }

                      [32m+[0m [0mhost_path {
                          [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
                        }

                      [32m+[0m [0miscsi {
                          [32m+[0m [0m[1m[0mfs_type[0m[0m         = (known after apply)
                          [32m+[0m [0m[1m[0miqn[0m[0m             = (known after apply)
                          [32m+[0m [0m[1m[0miscsi_interface[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mlun[0m[0m             = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m       = (known after apply)
                          [32m+[0m [0m[1m[0mtarget_portal[0m[0m   = (known after apply)
                        }

                      [32m+[0m [0mlocal {
                          [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)
                        }

                      [32m+[0m [0mnfs {
                          [32m+[0m [0m[1m[0mpath[0m[0m      = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mserver[0m[0m    = (known after apply)
                        }

                      [32m+[0m [0mpersistent_volume_claim {
                          [32m+[0m [0m[1m[0mclaim_name[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m  = (known after apply)
                        }

                      [32m+[0m [0mphoton_persistent_disk {
                          [32m+[0m [0m[1m[0mfs_type[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mpd_id[0m[0m   = (known after apply)
                        }

                      [32m+[0m [0mprojected {
                          [32m+[0m [0m[1m[0mdefault_mode[0m[0m = (known after apply)

                          [32m+[0m [0msources {
                              [32m+[0m [0mconfig_map {
                                  [32m+[0m [0m[1m[0mname[0m[0m     = (known after apply)
                                  [32m+[0m [0m[1m[0moptional[0m[0m = (known after apply)

                                  [32m+[0m [0mitems {
                                      [32m+[0m [0m[1m[0mkey[0m[0m  = (known after apply)
                                      [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                                      [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)
                                    }
                                }

                              [32m+[0m [0mdownward_api {
                                  [32m+[0m [0mitems {
                                      [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                                      [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)

                                      [32m+[0m [0mfield_ref {
                                          [32m+[0m [0m[1m[0mapi_version[0m[0m = (known after apply)
                                          [32m+[0m [0m[1m[0mfield_path[0m[0m  = (known after apply)
                                        }

                                      [32m+[0m [0mresource_field_ref {
                                          [32m+[0m [0m[1m[0mcontainer_name[0m[0m = (known after apply)
                                          [32m+[0m [0m[1m[0mdivisor[0m[0m        = (known after apply)
                                          [32m+[0m [0m[1m[0mresource[0m[0m       = (known after apply)
                                        }
                                    }
                                }

                              [32m+[0m [0msecret {
                                  [32m+[0m [0m[1m[0mname[0m[0m     = (known after apply)
                                  [32m+[0m [0m[1m[0moptional[0m[0m = (known after apply)

                                  [32m+[0m [0mitems {
                                      [32m+[0m [0m[1m[0mkey[0m[0m  = (known after apply)
                                      [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                                      [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)
                                    }
                                }

                              [32m+[0m [0mservice_account_token {
                                  [32m+[0m [0m[1m[0maudience[0m[0m           = (known after apply)
                                  [32m+[0m [0m[1m[0mexpiration_seconds[0m[0m = (known after apply)
                                  [32m+[0m [0m[1m[0mpath[0m[0m               = (known after apply)
                                }
                            }
                        }

                      [32m+[0m [0mquobyte {
                          [32m+[0m [0m[1m[0mgroup[0m[0m     = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mregistry[0m[0m  = (known after apply)
                          [32m+[0m [0m[1m[0muser[0m[0m      = (known after apply)
                          [32m+[0m [0m[1m[0mvolume[0m[0m    = (known after apply)
                        }

                      [32m+[0m [0mrbd {
                          [32m+[0m [0m[1m[0mceph_monitors[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0mfs_type[0m[0m       = (known after apply)
                          [32m+[0m [0m[1m[0mkeyring[0m[0m       = (known after apply)
                          [32m+[0m [0m[1m[0mrados_user[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mrbd_image[0m[0m     = (known after apply)
                          [32m+[0m [0m[1m[0mrbd_pool[0m[0m      = (known after apply)
                          [32m+[0m [0m[1m[0mread_only[0m[0m     = (known after apply)

                          [32m+[0m [0msecret_ref {
                              [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
                              [32m+[0m [0m[1m[0mnamespace[0m[0m = (known after apply)
                            }
                        }

                      [32m+[0m [0msecret {
                          [32m+[0m [0m[1m[0mdefault_mode[0m[0m = (known after apply)
                          [32m+[0m [0m[1m[0moptional[0m[0m     = (known after apply)
                          [32m+[0m [0m[1m[0msecret_name[0m[0m  = (known after apply)

                          [32m+[0m [0mitems {
                              [32m+[0m [0m[1m[0mkey[0m[0m  = (known after apply)
                              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                              [32m+[0m [0m[1m[0mpath[0m[0m = (known after apply)
                            }
                        }

                      [32m+[0m [0mvsphere_volume {
                          [32m+[0m [0m[1m[0mfs_type[0m[0m     = (known after apply)
                          [32m+[0m [0m[1m[0mvolume_path[0m[0m = (known after apply)
                        }
                    }
                }
            }
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @g1soori, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*